Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis-data/repos/bbl232/homelab-k3s-base-services/3/default/default.tfplan"' in '/atlantis-data/repos/bbl232/homelab-k3s-base-services/3/default': exit status 1
module.authentik_system.random_password.postgresql_password: Refreshing state... [id=none]
module.authentik_system.random_password.authentik_secret_key: Refreshing state... [id=none]
module.authentik_system.random_password.akadmin_password: Refreshing state... [id=none]
module.authentik_system.random_password.akadmin_api_key: Refreshing state... [id=none]
module.pihole_system.data.kubernetes_service_v1.traefik: Reading...
module.pihole_system.data.kubernetes_service_v1.traefik: Read complete after 0s [id=kube-system/traefik]
module.atlantis.kubernetes_cluster_role_binding_v1.atlantis-admin: Refreshing state... [id=atlantis-cluster-admin]
module.omada_controller.kubernetes_namespace_v1.omada_controller: Refreshing state... [id=omada-controller]
module.atlantis.kubernetes_namespace_v1.namespace: Refreshing state... [id=atlantis-system]
module.longhorn_system.kubernetes_namespace.longhorn_system: Refreshing state... [id=longhorn-system]
module.dashboard.kubernetes_namespace_v1.kube_dashboard: Refreshing state... [id=kubernetes-dashboard]
module.authentik_system.kubernetes_manifest.ingressroute: Refreshing state...
module.traefik_config.kubernetes_manifest.traefik_entrypoints: Refreshing state...
module.authentik_system.kubernetes_manifest.certificate_authentik_auth_billv_ca: Refreshing state...
module.pihole_system.kubernetes_manifest.middleware_ipallowlist: Refreshing state...
module.pihole_system.kubernetes_manifest.assistant_ingressroute: Refreshing state...
module.longhorn_system.kubernetes_manifest.recurringjob_longhorn_system_daily_backup: Refreshing state...
module.pihole_system.kubernetes_manifest.ingressroute: Refreshing state...
module.pihole_system.kubernetes_manifest.middleware_admin: Refreshing state...
kubernetes_service_account_v1.bill: Refreshing state... [id=default/bill]
kubernetes_service_account_v1.test: Refreshing state... [id=default/test]
kubernetes_secret_v1.bill_token: Refreshing state... [id=default/bill-token]
module.pihole_system.helm_release.pihole: Refreshing state... [id=pihole]
module.cert-manager.kubernetes_manifest.namespace_cert_manager: Refreshing state...
module.longhorn_system.aws_s3_bucket.longhorn_backups: Refreshing state... [id=longhorn-backups.billv.ca]
module.longhorn_system.aws_iam_user.longhorn: Refreshing state... [id=longhorn]
module.atlantis.aws_iam_user.atlantis: Refreshing state... [id=atlantis]
module.atlantis.data.aws_ssm_parameter.atlantis-key: Reading...
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Reading...
module.pihole_system.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.authentik_system.data.aws_ssm_parameter.smtp: Reading...
module.metallb-system.kubernetes_manifest.namespace_metallb_system: Refreshing state...
module.pihole_system.kubernetes_manifest.certificate_piholeassistant_billv_ca: Refreshing state...
module.authentik_system.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.atlantis.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.atlantis.kubernetes_manifest.ingressroute: Refreshing state...
module.omada_controller.kubernetes_manifest.ingressroute: Refreshing state...
module.longhorn_system.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.omada_controller.kubernetes_service_v1.omada_controller: Refreshing state... [id=omada-controller/omada-controller]
module.omada_controller.kubernetes_stateful_set_v1.omada: Refreshing state... [id=omada-controller/omada-controller]
module.longhorn_system.kubernetes_manifest.ingressroute: Refreshing state...
module.dashboard.helm_release.kube-dashboard: Refreshing state... [id=kubernetes-dashboard]
module.omada_controller.kubernetes_manifest.certificate_authentik_omada_billv_ca: Refreshing state...
kubernetes_cluster_role_binding.admin: Refreshing state... [id=bill]
module.omada_controller.kubernetes_manifest.servers_transport: Refreshing state...
module.dashboard.kubernetes_manifest.servers_transport: Refreshing state...
module.dashboard.kubernetes_manifest.ingressroute: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_webhook_subjectaccessreviews: Refreshing state...
module.dashboard.kubernetes_manifest.certificate_kube_billv_ca: Refreshing state...
module.atlantis.data.aws_ssm_parameter.atlantis-key: Still reading... [10s elapsed]
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Still reading... [10s elapsed]
module.cert-manager.kubernetes_manifest.rolebinding_cert_manager_cert_manager_cert_manager_tokenrequest: Refreshing state...
module.authentik_system.data.aws_ssm_parameter.smtp: Still reading... [10s elapsed]
module.cert-manager.kubernetes_manifest.rolebinding_kube_system_cert_manager_cainjector_leaderelection: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_issuers_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.serviceaccount_cert_manager_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_certificates: Refreshing state...
module.cert-manager.kubernetes_manifest.service_cert_manager_cert_manager: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_ingress_shim: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_ingress_shim: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_issuers: Refreshing state...
module.cert-manager.kubernetes_manifest.rolebinding_kube_system_cert_manager_leaderelection: Refreshing state...
module.cert-manager.kubernetes_manifest.role_cert_manager_cert_manager_tokenrequest: Refreshing state...
module.atlantis.data.aws_ssm_parameter.atlantis-key: Still reading... [20s elapsed]
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Still reading... [20s elapsed]
module.authentik_system.data.aws_ssm_parameter.smtp: Still reading... [20s elapsed]
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_webhook_subjectaccessreviews: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_orders: Refreshing state...
module.cert-manager.kubernetes_manifest.service_cert_manager_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.deployment_cert_manager_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.serviceaccount_cert_manager_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_view: Refreshing state...
module.cert-manager.kubernetes_manifest.deployment_cert_manager_cert_manager: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_challenges_acme_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.service_cert_manager_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_clusterissuers_cert_manager_io: Refreshing state...
module.atlantis.data.aws_ssm_parameter.atlantis-key: Still reading... [30s elapsed]
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Still reading... [30s elapsed]
module.authentik_system.data.aws_ssm_parameter.smtp: Still reading... [30s elapsed]
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_approve_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_certificaterequests_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_challenges: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_certificates_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_certificatesigningrequests: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_cluster_view: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_clusterissuers: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_orders: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_challenges: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_clusterissuers: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_approve_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_certificates: Refreshing state...
module.cert-manager.kubernetes_manifest.validatingwebhookconfiguration_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.serviceaccount_cert_manager_cert_manager: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_issuers: Refreshing state...
module.atlantis.data.aws_ssm_parameter.atlantis-key: Still reading... [40s elapsed]
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Still reading... [40s elapsed]
module.authentik_system.data.aws_ssm_parameter.smtp: Still reading... [40s elapsed]
module.cert-manager.kubernetes_manifest.role_kube_system_cert_manager_cainjector_leaderelection: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.role_cert_manager_cert_manager_webhook_dynamic_serving: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_certificatesigningrequests: Refreshing state...
module.cert-manager.kubernetes_manifest.rolebinding_cert_manager_cert_manager_webhook_dynamic_serving: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_orders_acme_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_edit: Refreshing state...
module.cert-manager.kubernetes_manifest.deployment_cert_manager_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.role_kube_system_cert_manager_leaderelection: Refreshing state...
module.cert-manager.kubernetes_manifest.mutatingwebhookconfiguration_cert_manager_webhook: Refreshing state...
module.metallb-system.kubernetes_manifest.clusterrole_metallb_system_speaker: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_bfdprofiles_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.role_metallb_system_pod_lister: Refreshing state...
module.atlantis.data.aws_ssm_parameter.atlantis-key: Still reading... [50s elapsed]
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Still reading... [50s elapsed]
module.authentik_system.data.aws_ssm_parameter.smtp: Still reading... [50s elapsed]
module.metallb-system.kubernetes_manifest.customresourcedefinition_ipaddresspools_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_communities_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.clusterrole_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_l2advertisements_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.role_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.serviceaccount_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_bgppeers_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_bgpadvertisements_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.configmap_metallb_system_metallb_excludel2: Refreshing state...
module.metallb-system.kubernetes_manifest.daemonset_metallb_system_speaker: Refreshing state...
module.metallb-system.kubernetes_manifest.validatingwebhookconfiguration_metallb_webhook_configuration: Refreshing state...
module.atlantis.data.aws_ssm_parameter.atlantis-key: Still reading... [1m0s elapsed]
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Still reading... [1m0s elapsed]
module.authentik_system.data.aws_ssm_parameter.smtp: Still reading... [1m0s elapsed]
module.metallb-system.kubernetes_manifest.clusterrolebinding_metallb_system_speaker: Refreshing state...
module.metallb-system.kubernetes_manifest.serviceaccount_metallb_system_speaker: Refreshing state...
module.metallb-system.kubernetes_manifest.service_metallb_system_metallb_webhook_service: Refreshing state...
module.metallb-system.kubernetes_manifest.rolebinding_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.secret_metallb_system_metallb_webhook_cert: Refreshing state...
module.metallb-system.kubernetes_manifest.rolebinding_metallb_system_pod_lister: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_servicel2statuses_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.clusterrolebinding_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.deployment_metallb_system_controller: Refreshing state...
module.atlantis.data.aws_ssm_parameter.atlantis-key: Still reading... [1m10s elapsed]
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Still reading... [1m10s elapsed]
module.authentik_system.data.aws_ssm_parameter.smtp: Still reading... [1m10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.longhorn_system.aws_s3_bucket.longhorn_backups will be created
  + resource "aws_s3_bucket" "longhorn_backups" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "longhorn-backups.billv.ca"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: reading SSM Parameter (/runatlantis/key): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: fc5a0781-a582-45ff-b342-7c9a76e3a3ed, api error AccessDeniedException: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-1:398183381961:parameter/runatlantis/key because no identity-based policy allows the ssm:GetParameter action
│ 
│   with module.atlantis.data.aws_ssm_parameter.atlantis-key,
│   on modules/atlantis-system/main.tf line 37, in data "aws_ssm_parameter" "atlantis-key":
│   37: data "aws_ssm_parameter" "atlantis-key" {
│ 
╵
╷
│ Error: reading SSM Parameter (/runatlantis/webhook-secret): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: d46d30cf-a711-4f6f-91f9-cc095338ed83, api error AccessDeniedException: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-1:398183381961:parameter/runatlantis/webhook-secret because no identity-based policy allows the ssm:GetParameter action
│ 
│   with module.atlantis.data.aws_ssm_parameter.atlantis-secret,
│   on modules/atlantis-system/main.tf line 41, in data "aws_ssm_parameter" "atlantis-secret":
│   41: data "aws_ssm_parameter" "atlantis-secret" {
│ 
╵
╷
│ Error: reading IAM User (atlantis): operation error IAM: GetUser, https response error StatusCode: 403, RequestID: c9c68bf9-b1d9-49e6-97dd-d0b3e333b0ed, api error AccessDenied: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: iam:GetUser on resource: user atlantis because no identity-based policy allows the iam:GetUser action
│ 
│   with module.atlantis.aws_iam_user.atlantis,
│   on modules/atlantis-system/main.tf line 45, in resource "aws_iam_user" "atlantis":
│   45: resource "aws_iam_user" "atlantis" {
│ 
╵
╷
│ Error: reading SSM Parameter (zoho-smtp-creds): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 8a51d997-e0d6-4b7d-a5ec-50b045cbb539, api error AccessDeniedException: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-1:398183381961:parameter/zoho-smtp-creds because no identity-based policy allows the ssm:GetParameter action
│ 
│   with module.authentik_system.data.aws_ssm_parameter.smtp,
│   on modules/authentik-system/main.tf line 15, in data "aws_ssm_parameter" "smtp":
│   15: data "aws_ssm_parameter" "smtp" {
│ 
╵
╷
│ Error: reading IAM User (longhorn): operation error IAM: GetUser, https response error StatusCode: 403, RequestID: 41106372-5ca8-48a6-95bd-953fa45274b0, api error AccessDenied: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: iam:GetUser on resource: user longhorn because no identity-based policy allows the iam:GetUser action
│ 
│   with module.longhorn_system.aws_iam_user.longhorn,
│   on modules/longhorn-system/main.tf line 25, in resource "aws_iam_user" "longhorn":
│   25: resource "aws_iam_user" "longhorn" {
│ 
╵


```
</details>